stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.h
#pragma once

/**
  ******************************************************************************
  * @file    STM32LoRaWAN.h
  * @author  Matthijs Kooijman
  * @brief   Main header for the STM32LoRaWAN library.
  *
  * API based on the MKRWAN / MKRWAN_v2 library.
  *
  ******************************************************************************
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * Revised BSD License - https://spdx.org/licenses/BSD-3-Clause.html
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted provided that the following conditions
  * are met:
  *
  *     1. Redistributions of source code must retain the above copyright notice,
  *        this list of conditions and the following disclaimer.
  *     2. Redistributions in binary form must reproduce the above copyright
  *        notice, this list of conditions and the following disclaimer in the
  *        documentation and/or other materials provided with the distribution.
  *     3. Neither the name of the copyright holder nor the names of its
  *        contributors may be used to endorse or promote products derived from this
  *        software without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  */

#include "Arduino.h"
#include "STM32CubeWL/LoRaWAN/Mac/LoRaMac.h"
#include "BSP/mw_log_conf.h"
#include "BSP/timer_if.h"
#include "STM32RTC.h"


/**
 * Supported regions, to be passed to STM32LoRaWAN::begin() to select
 * region-specific settings and frequency plan.
 */
typedef enum {
  AS923 = LORAMAC_REGION_AS923,
  AU915 = LORAMAC_REGION_AU915,
  CN470 = LORAMAC_REGION_CN470,
  CN779 = LORAMAC_REGION_CN779,
  EU433 = LORAMAC_REGION_EU433,
  EU868 = LORAMAC_REGION_EU868,
  KR920 = LORAMAC_REGION_KR920,
  IN865 = LORAMAC_REGION_IN865,
  US915 = LORAMAC_REGION_US915,
  RU864 = LORAMAC_REGION_RU864,
  // TODO: AU915_TTN = 0x80 | AU915,
} _lora_band;

typedef enum {
  RFO = 0,
  PABOOST,
} _rf_mode;

// Reuse enum from STM32CubeWL that uses the same names
using _lora_class = DeviceClass_t;

class STM32LoRaWAN : public Stream {
  public:
    /**
     * @anchor initialization
     * @name Initialization
     * @{ */

    /**
     * Initialize the library. Must be called before any other methods.
     *
     * \param band The region/band to use. See \ref _lora_band for
     * allowed values.
     *
     * \note The selected band must be within the frequency range of the
     * board design, this cannot be automatically checked by the
     * software.
     */
    bool begin(_lora_band band);
    /// @}


    /**
     * @anchor joinOTAA
     * @name OTAA Join
     *
     * This method can be used to join the network using the OTAA
     * (over-the-air-activation) method, where the device uses the
     * credentials specified here to negotiate a session (including
     * session address and encryption keys) with the network by
     * exchanging messages.
     *
     * The appEUI and appKey are mandatory, the devEUI can be omitted,
     * in which case the devEUI baked into the chip is used.
     *
     * For both EUIs and the key, you can pass a hex-encoded (MSB-first)
     * string (`String` object or `const char*`), for the EUIs also
     * a raw integer (64-bits).
     *
     * These methods will perform multiple join attempts and block until
     * the join completes successfully, or a timeout (60 seconds) occurs.
     *
     * There are some subtle differences with MKRWAN in how the join
     * process works:
     *  - MKRWAN returns directly after the timeout, while this library
     *    finishes the running join attempt before joinOTAA returns.
     *  - With MKRWAN the module continues doing join attempts in the
     *    background, while this library stops attempting them after
     *    joinOTAA returns.
     *  - With MKRWAN the module automatically decreases/alternates the
     *    datarate in a region-specific way for all regions, this
     *    library uses the configured datarate (with `datarate()`) for
     *    most regions, but uses fixed datarates (according to LoRaWAN
     *    regional parameters) for US915/AU915/AS923.
     *
     * \MKRWANApiDifference{Timeout parameter omitted (also omitted in MKRWAN_v2)}
     * \MKRWANApiDifference{Added version that accepts uint64_t appEUI}
     * \MKRWANApiDifference{Differences in timeout and retry datarate handling}
     *
     * @{ */
    bool joinOTAA(const char *appEui, const char *appKey, const char *devEui) { return setDevEui(devEui) && joinOTAA(appEui, appKey); }
    bool joinOTAA(const char *appEui, const char *appKey) { return setAppEui(appEui) && setAppKey(appKey) && joinOTAA(); }
    bool joinOTAA(String appEui, String appKey) { return joinOTAA(appEui.c_str(), appKey.c_str()); }
    bool joinOTAA(String appEui, String appKey, String devEui) { return joinOTAA(appEui.c_str(), appKey.c_str(), devEui.c_str()); }
    /** \NotInMKRWAN */
    bool joinOTAA(uint64_t appEui, const char *appKey, uint64_t devEui) { return setDevEui(devEui) && joinOTAA(appEui, appKey); }
    /** \NotInMKRWAN */
    bool joinOTAA(uint64_t appEui, const char *appKey) { return setAppEui(appEui) && setAppKey(appKey) && joinOTAA(); }
    /** \NotInMKRWAN */
    bool joinOTAA(uint64_t appEui, String appKey, uint64_t devEui) { return joinOTAA(appEui, appKey.c_str(), devEui); }
    /** \NotInMKRWAN */
    bool joinOTAA(uint64_t appEui, String appKey) { return joinOTAA(appEui, appKey.c_str()); }

    /**
     * Perform a join with parameters previously set using after using
     * setAppEui(), setAppKey() and optionally setDevEui().
     *
     * \NotInMKRWAN
     */
    bool joinOTAA();
    /// @}

    /**
     * @anchor joinABP
     * @name ABP Join
     *
     * This method can be used to join the network using the ABP method,
     * where the session address and keys are preconfigured and no
     * exchange with the network is needed before data can be sent.
     *
     * For the address and both keys, you can pass a hex-encoded
     * (MSB-first) string (`String` object or `const char*`), for the
     * address also a raw integer (32-bits).
     *
     * \warning This library does *not* preserve frame counters in
     * non-volatile storage, so it starts at zero after every reset.
     * This only works when the server disables framecounter-based replay
     * attacks, otherwise only the first session will work and data will
     * be dropped after the first reset.
     *
     * \note An ABP join returns immediately, it does not need to wait
     * for the network, so there is no separate non-blocking/async
     * version of this method.
     *
     * @{ */
    bool joinABP(const char *devAddr, const char *nwkSKey, const char *appSKey) { return setDevAddr(devAddr) && setNwkSKey(nwkSKey) && setAppSKey(appSKey) && joinABP(); }
    bool joinABP(String devAddr, String nwkSKey, String appSKey) { return joinABP(devAddr.c_str(), nwkSKey.c_str(), appSKey.c_str()); }
    bool joinABP(uint32_t devAddr, String nwkSKey, String appSKey) { return setDevAddr(devAddr) && setNwkSKey(nwkSKey) && setAppSKey(appSKey) && joinABP(); }

    /**
     * Perform a join with parameters previously set using after using
     * setDevAddr(), setNwkSKey() and setAppSKey().
     *
     * \NotInMKRWAN
     */
    bool joinABP();
    /// @}


    /**
     * @anchor sending
     * @name Packet sending
     *
     * These methods allow sending a data packet.
     *
     * After a join was completed, sending a packet consists of calling
     * beginPacket(), writing data to using the Stream write methods,
     * and calling endPacket() to finish up and send the packet.
     *
     * The port number to use for the packet can be set using setPort()
     * (to be called before endPacket()). A confirmed packet can be sent
     * using the parameter to endPacket(), which will request the
     * network to confirm the packet was received (but if not, no
     * automatic retries are done).
     *
     * The send() method offers an alternative (and always non-blocking)
     * API, where you pass a payload already built into your own buffer.
     * @{ */
    void beginPacket();
    /**
     * Finalize and send a packet previously prepared using
     * beginPacket() and write().
     *
     * This blocks until the packet is completely sent an both RX
     * windows have been completed.
     *
     * \return The number of bytes sent when successful, or -1 when the
     * packet could not be sent. For confirmed packets, also returns -1
     * when no confirmation was received (in that case the packet might
     * still have been sent correctly).
     *
     * \MKRWANApiDifference{This library blocks for all packets, not just confirmed packets.}
     */
    int endPacket(bool confirmed = false);
    /// @}


    /**
     * @anchor print
     * @name Stream/Print writing
     *
     * These are standard methods defined by the Arduino Stream (or
     * actually its Print superclass) class to allow writing data into
     * a packet being built.
     *
     * In addition to the methods listed here, all methods offered by
     * the Arduino Print class are also available (but at the time of
     * writing, unfortunately not documented by Arduino).
     *
     * There is one addition, there is a templated write method that
     * accepts any type of object (e.g. a struct, integer, etc.) and
     * writes its memory representation into the packet. When using
     * this, note that data will be written exactly as the processor
     * stores it in memory, so typically little-endian.
     * @{ */
    virtual size_t write(uint8_t c);
    virtual size_t write(const uint8_t *buffer, size_t size);

    template <typename T> inline size_t write(T val) { return write((uint8_t *)&val, sizeof(T)); };
    using Print::write;

    /**
     * Returns how many bytes can still be written into the current packet.
     *
     * This takes the maximum payload size at the current datarate into
     * account. When this is called directly after beginPacket(), it returns
     * the maximum payload size.
     *
     * You can usually write more than this amount, but then sending the
     * packet with endPacket() will likely fail.
     */
    virtual int availableForWrite();

    /**
     * This is a no-op, to send written data, use endPacket(). \DummyImplementation
     */
    virtual void flush() { }

    /// @}


    /**
     * @anchor reception
     * @name Packet reception
     *
     * These methods are about reception of downlink packets.
     *
     * After an uplink packet was fully sent, a received downlink packet
     * can be checked by calling parsePacket() (or simply available() to
     * see if any bytes are ready to read). If so, the contents of the
     * packet can be read using the Stream read methods.
     *
     * @{ */

    /**
     * Alias of available(), returns the number of bytes available to
     * read.
     *
     * \note The MKRWAN documentation suggests this method must be
     * called before calling read, but the code gives no indication that
     * this is at all required.
     */
    int parsePacket();

    /**
     * Returns the port number of the most recently received packet.
     */
    uint8_t getDownlinkPort() { return rx_port; }
    /// @}


    /**
     * @anchor stream
     * @name Stream reading
     *
     * These are standard methods defined by the Arduino Stream class to
     * allow reading received data.
     *
     * In addition to the methods listed here, all methods offered by
     * the Arduino Stream class are also available, see
     * https://www.arduino.cc/reference/en/language/functions/communication/stream/
     *
     * After a packet is received, the available() method can be used to
     * query how much bytes are in the packet (or after some bytes were
     * read, how many are left to be read), and various read() versions
     * can be used to read the data.
     *
     * \note If data is left unread when a new packet is received,
     * the new data will be appended to the unread data and it becomes
     * impossible to query where the first packet ends and the second
     * begins. It is recommended to always fully read any received data
     * before transmitting a new packet (which is, in class A LoRaWAN,
     * the only time a new packet can be received).
     *
     * @{ */
    int read(uint8_t *buf, size_t size);
    virtual int available();
    virtual int read();
    virtual int peek();


    /**
     * @name Setters for identifiers and keys
     *
     * These methods allow setting various identifiers and keys.
     *
     * You can pass a hex-encoded (MSB-first) string (`String` object or
     * `const char*`), or a raw integer (32-bits for DevAddr and 64-bits
     * for EUIs, keys are too long to be passed as an integer).
     *
     * \NotInMKRWAN
     * @{
     */
    bool setDevEui(const char *value) { return mibSetHex("DevEui", MIB_DEV_EUI, value); }
    bool setDevEui(String value) { return setDevEui(value.c_str()); }
    bool setDevEui(uint64_t value) { return mibSetUint64("DevEui", MIB_DEV_EUI, value); }
    bool setAppEui(const char *value) { return mibSetHex("AppEui", MIB_JOIN_EUI, value); }
    bool setAppEui(String value) { return setAppEui(value.c_str()); }
    bool setAppEui(uint64_t value) { return mibSetUint64("AppEui", MIB_JOIN_EUI, value); }
    bool setDevAddr(const char *value) { return mibSetHex("DevAddr", MIB_DEV_ADDR, value); }
    bool setDevAddr(String value) { return setDevAddr(value.c_str()); }
    bool setDevAddr(uint32_t value) { return mibSetUint32("DevAddr", MIB_DEV_ADDR, value); }
    bool setAppKey(const char *value)
    {
      // In LoRaWAN 1.0, only the appKey was configured and all keys
      // were derived from that. In 1.1, this was split into an appKey
      // and nwkKey. However, when running the LoRaMac-Node in 1.0 mode,
      // it actually seems to use nwkKey, not appKey. So to support
      // sketches that only configure appKey for 1.0, this saves the
      // appKey to nwkKey as well. But to also prepare for future
      // support of 1.1 and sketches that configure both, only do this
      // if no nwkKey was explicitly configured.
      return mibSetHex("AppKey", MIB_APP_KEY, value)
             && (this->nwk_key_set || mibSetHex("NwkKey", MIB_NWK_KEY, value));

