stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.h
    }
    bool setAppKey(String value) { return setAppKey(value.c_str()); }
    bool setNwkKey(const char *value)
    {
      this->nwk_key_set = true;
      return mibSetHex("NwkKey", MIB_NWK_KEY, value);
    }
    bool setNwkKey(String value) { return setNwkKey(value.c_str()); }
    bool setAppSKey(const char *value) { return mibSetHex("AppSKey", MIB_APP_S_KEY, value); }
    bool setAppSKey(String value) { return setAppSKey(value.c_str()); }
    bool setNwkSKey(const char *value)
    {
#if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01010100 ))
      // When compiled for 1.1 crypto, three different keys are used.
      // When the sketch only supplies a single key, just set all
      // three keys to the same value.
      return mibSetHex("NwkSEncKey", MIB_NWK_S_ENC_KEY, value)
             && mibSetHex("FNwkSIntKey", MIB_F_NWK_S_INT_KEY, value)
             && mibSetHex("SNwkSIntKey", MIB_S_NWK_S_INT_KEY, value);
#else /* ( LORAMAC_VERSION == 0x01010100 ) */
      return mibSetHex("NwkSKey", MIB_NWK_S_KEY, value);
#endif /* ( LORAMAC_VERSION == 0x01010100 ) */
    }
    bool setNwkSKey(String value) { return setNwkSKey(value.c_str()); }

#if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01010100 ))
    bool setNwkSEncKey(const char *value) { return mibSetHex("NwkSEncKey", MIB_NWK_S_ENC_KEY, value); }
    bool setNwkSEncKey(String value) { return setNwkSEncKey(value.c_str()); }
    bool setFNwkSIntKey(const char *value) { return mibSetHex("FNwkSIntKey", MIB_F_NWK_S_INT_KEY, value); }
    bool setFNwkSIntKey(String value) { return setFNwkSIntKey(value.c_str()); }
    bool setSNwkSIntKey(const char *value) { return mibSetHex("SNwkSIntKey", MIB_S_NWK_S_INT_KEY, value); }
    bool setSNwkSIntKey(String value) { return setSNwkSIntKey(value.c_str()); }
#endif /* ( LORAMAC_VERSION == 0x01010100 ) */
    /// @}

    /**
     * @name Getters for identifiers
     *
     * These methods allow getting various identifiers.
     *
     * The value is written into the pointer passed, which can be
     * a String object to get a hex-encoded (MSB-first) string, or a raw
     * integer (32-bits for DevAddr and 64-bits for EUIs).
     *
     * Note that encryption keys cannot be retrieved.
     * @{
     */
    bool getDevEui(String *value) { return mibGetHex("DevEui", MIB_DEV_EUI, value); }
    bool getDevEui(uint64_t *value) { return mibGetUint64("DevEui", MIB_DEV_EUI, value); }
    bool getAppEui(String *value) { return mibGetHex("AppEui", MIB_JOIN_EUI, value); }
    bool getAppEui(uint64_t *value) { return mibGetUint64("AppEui", MIB_JOIN_EUI, value); }
    bool getDevAddr(String *value) { return mibGetHex("DevAddr", MIB_DEV_ADDR, value); }
    bool getDevAddr(uint32_t *value) { return mibGetUint32("DevAddr", MIB_DEV_ADDR, value); }
    /// @}


    /**
     * @name Querying current state
     *
     * @{
     */

    /**
     * Return the currently configured deviceEUI. On startup, this is
     * the EUI for the chip (stored in ROM). If changed (i.e. with
     * joinOTAA() or setDevEUI()), the changed value is returned
     * instead.
     */
    String deviceEUI();
    String getDevAddr();

    /**
     * Returns whether connected to the network (i.e. for OTAA
     * a successful join exchange has happened, or for ABP session
     * information has been supplied by calling joinABP).
     */
    bool connected();

    /**
     * Returns whether the modem is currently busy processing a request.
     * After a non-blocking request (e.g. unconfirmed uplink), this
     * returns true until the request is completed and then returns
     * false until some new request is made.
     *
     * \NotInMKRWAN
     */
    bool busy();

    /** Converts this object into a bool (e.g. for using in an if
     * directly), returning the same value as connected().
     */
    operator bool() { return connected(); }
    /// @}


    /** @name Radio / transmission configuration
     *
     * These methods allow configuring various radio and transmission
     * parameters.
     *
     * @{ */

    /**
     * Set the datarate to use for future packets. If ADR is enabled,
     * that might change the datarate again (but the rate passed should
     * be used for at least one uplink packet).
     */
    bool dataRate(uint8_t dr);
    /** Retrieve the current datarate (possibly modified by ADR) */
    int getDataRate();
    /**
     * Set the transmit power (MKRWAN_v2 version)
     *
     * \param index This sets the power index which is passed to the
     * underlying stack directly. Unexpectedly, a value of 0 indicates
     * the maximum power, and higher values *decrease* the value in
     * steps of 2dB (so 0 = max, 1 = -2dB, 2 = -4dB, etc.).
     *
     * The available options depend on the region (see the TX_POWER
     * constants in LoRaMacInterfaces.h), but indices 0-5 should be
     * supported by all regions (but most regions support additional
     * values).
     *
     * If an unavailable option is passed, this method will fail and
     * return false.
     */
    bool power(uint8_t index);

    /**
     * Set the transmit power (MKRWAN version)
     *
     * \see power(uint8_t) for details.
     *
     * \param mode This parameter is ignored, the mode is automatically
     * determined based on the selected power.
     * \param index See power(uint8_t) for details.
     */
    bool power(_rf_mode mode, uint8_t index) { (void)mode; return power(index); }

    /**
     * Set transmit power in dB.
     *
     * \param db The transmit power in dB. It must be 0 or negative,
     * where 0 is the maximum power and negative values indicate how
     * much dB below the maximum to operate.
     *
     * Note that only even values are supported, but an uneven value will
     * be rounded down automatically.
     *
     * The available options depend on the region (see the TX_POWER
     * constants in LoRaMacInterfaces.h), but down to -10 dB should be
     * supported by all regions (but most regions support additional
     * values, down to -28 dB for some regions).
     *
     * \NotInMKRWAN
     */
    bool powerdB(int8_t db);

