stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.h
    /** Return the port used for data transmission. \NotInMKRWAN */
    uint8_t getPort();
    /** Set the port to be used for data transmission. */
    bool setPort(uint8_t port);

    /**
     * Enable or disable ADR (automatic datarate).
     *
     * This is enabled by default and allows the network to increase the
     * datarate used (when sending downlink commands) when transmissions
     * from this device are received with sufficient quality that
     * a higher datarate is expected to still be received. In addition,
     * it causes the device to request periodic confirmations and lets
     * it reduce the datarate when transmissions are left unconfirmed.
     *
     * Together, these two mechanisms should ensure the highest possible
     * datarate is used, maximizing bandwidth and/or reducing spectrum
     * usage (time on air).
     */
    bool setADR(bool adr);
    /** Return whether ADR (automatic datarate) is enabled. */
    int getADR();
    /// @}


    /** @name Advanced configuration
     *
     * These methods allow configuring advanced settings, which are
     * usually not required for normal operation.
     *
     * @{ */

    /**
     * When false is passed, duty cycle limits are no longer checked.
     *
     * \warning Use with care, disabling duty cycle limits can cause
     * violations of laws and regulations around use of the RF spectrum!
     */
    bool dutyCycle(bool on);

    /**
     * Configure the syncword to use. The default is the "public"
     * (LoRaWAN standard) syncword, when set to false this uses another
     * syncword that is often recommended for "private" networks.
     */
    bool publicNetwork(bool publicNetwork);

    /** Return the datarate used for the RX2 window. */
    int getRX2DR();
    /**
     * Set the datarate used for the RX2 window. The network might
     * override this value using downlink commands (typically only in
     * OTAA mode).
     */
    bool setRX2DR(uint8_t dr);

    /** Return the frequency used for the RX2 window. */
    uint32_t getRX2Freq();
    /**
     * Set the frequency used for the RX2 window. The network might
     * override this value using downlink commands (typically only in
     * OTAA mode).
     */
    bool setRX2Freq(uint32_t freq);

    /** Alias of getRX2Freq() for MKRWAN_v2 compatibility */
    int getrxfreq();
    /// @}


    /** @name Channel manipulation
     *
     * These methods allow manipulating the list of enabled channels.
     *
     * The number of channels that are actually available and defined
     * and their frequency and other settings are region-dependent.
     * The fixed frequency regions (US915 and AU915) have 96 fixed
     * channels, while the other regions have just a couple (up to 16)
     * of channels defined.
     *
     * \note The list of channels will be reset when starting an OTAA
     * join an when the join completes. Also, the network can send
     * commands to modify the channel plan (define new channels or
     * replace them, and enable/disable them), also as part of ADR
     * messages.
     *
     * @{ */

    bool enableChannel(unsigned pos);
    bool disableChannel(unsigned pos);
    /** \NotInMKRWAN */
    bool modifyChannelEnabled(unsigned pos, bool value);
    bool isChannelEnabled(unsigned pos);
    /// @}


    /** @name Frame counters
     *
     * These methods allow access to the up and down frame counters.
     *
     * \note Currently setting the framecounters is not supported, since
     * the underlying LoRaWAN library has no obvious way to set these.
     * This might be implemented in the future with some extra work.
     *
     * @{ */

    /**
     * Return the frame counter of the most recent uplink message that
     * was completely transmitted (i.e. after the RX windows have
     * passed).
     */
    int32_t getFCU();

    /**
     * Return the frame counter of the most recent downlink message that
     * was received.
     */
    int32_t getFCD();

    /** \NotImplemented */
    [[gnu::error("Not implemented in STM32LoRaWAN")]]
    bool setFCD(uint16_t fcd);

    /** \NotImplemented */
    [[gnu::error("Not implemented in STM32LoRaWAN")]]
    bool setFCU(uint16_t fcu);

    /// @}


    /**
     * @name Advanced MIB access
     *
     * These methods allow direct access to the MIB (Mac Information
     * Base) layer of the underlying stack to set and query values.
     * These are only intended for advanced usage, when the regular API
     * does not provide sufficient access.
     *
     * @param name Parameter name, only used in error messages
     * @{
     */
    bool mibGet(const char *name, Mib_t type, MibRequestConfirm_t &mibReq);
    bool mibGetBool(const char *name, Mib_t type, bool *value);
    bool mibGetUint8(const char *name, Mib_t type, uint8_t *value);
    bool mibGetInt8(const char *name, Mib_t type, int8_t *value);
    bool mibGetUint32(const char *name, Mib_t type, uint32_t *value);
    bool mibGetUint64(const char *name, Mib_t type, uint64_t *value);
    bool mibGetHex(const char *name, Mib_t type, String *value);
    bool mibGetRxChannelParams(const char *name, Mib_t type, RxChannelParams_t *value);
    bool mibGetPtr(const char *name, Mib_t type, void **value);
    bool mibSet(const char *name, Mib_t type, MibRequestConfirm_t &mibReq);
    bool mibSetBool(const char *name, Mib_t type, bool value);
    bool mibSetUint8(const char *name, Mib_t type, uint8_t value);
    bool mibSetInt8(const char *name, Mib_t type, int8_t value);
    bool mibSetUint32(const char *name, Mib_t type, uint32_t value);
    bool mibSetUint64(const char *name, Mib_t type, uint64_t value);
    bool mibSetHex(const char *name, Mib_t type, const char *value);
    bool mibSetRxChannelParams(const char *name, Mib_t type, RxChannelParams_t value);
    bool mibSetPtr(const char *name, Mib_t type, void *value);
    size_t mibHexSize(const char *name, Mib_t type);
    /// @}


    /** @name Non-blocking (async) methods
     *
     * These are variants of other methods that are asynchronous, i.e.
     * these start an operation and then return immediately without
     * waiting (blocking) for the operation to complete.
     *
     * After calling these methods, the sketch must periodically call
     * the `maintain()` method to allow any background work to be
     * performed. This must be done at least until `busy()` returns
     * false. You can use `maintainUntilIdle()` for this if you no
     * longer have other things to do while waiting.
     */

    /**
     * Do an asynchronous OTAA join using previously configured AppEui,
     * AppKey and optionally DevEui. This can be used in place of
     * joinOTAA() when you do not want blocking behavior.
     *
     * This initiates a single join attempt (one JoinReq message). After
     * both receive windows are complete, `busy()` will become false and
     * the sketch can call `connected()` to see if the join attempt
     * was successful. If not, it is up to the sketch to decide on
     * retries.
     *
     * \NotInMKRWAN
     */
    bool joinOTAAAsync();

    /**
     * Finalize and asynchronously send a packet. This can be used in
     * place of `endPacket()` when you do not want blocking behavior.
     *
     * The return value only reflects whether the packet could
     * successfully queued, to see if a confirmed packet was actually
     * confirmed by the network, call lastAck().
     *
     * \NotInMKRWAN
     */
    int endPacketAsync(bool confirmed = false);

    /**
     * Send a packet asynchronously by passing a buffer. This can be
     * used instead of beginPacket() / write() / endPacket(), when you
     * prefer building the data to send in an external buffer and do not
     * want to skip one buffer copy.
     *
     * The return value only reflects whether the packet could
     * successfully queued, to see if a confirmed packet was actually
     * confirmed by the network, call lastAck().
     *
     * \NotInMKRWAN
     */
    bool send(const uint8_t *payload, size_t size, bool confirmed);

    /**
     * Returns true when the most recently transmitted packet has
     * received a confirmation from the network (if requested). Directly
     * after transmitting any packet, this will return false and it will
     * become true when the ack is received (which is, at the latest,
     * when busy() becomes false again).
     *
     * \NotInMKRWAN
     */
    uint8_t lastAck() { return last_tx_acked; }

    /**
     * Perform any pending work, or quickly return if there is none.
     *
     * While the stack is busy, this method should be called very
     * frequently to ensure accurate timing. It is automatically called
     * by all blocking methods in this library.
     */
    void maintain();

    /**
     * Call maintain() to process any background work for as long as the
     * stack is busy (i.e. until busy() returns false).
     *
     * \NotInMKRWAN
     */
    void maintainUntilIdle();

    /**
     * Registers a callback that is called whenever there is some work
     * to do and the maintain() function must be called soon.
     *
     * \warning This callback is called from an interrupt handler, so it
     * should not do any work and definitely *not* call `maintain()`,
     * but just set a flag, enable a task, or something similarly short,
     * and make sure to do that in a interrupt-safe manner.
     *
     * When using this callback, it is not needed to call the
     * `maintain()` method unless this callback is called, allowing
     * applications to be more efficient, or use sleeping (but care
     * should be taken to prevent race conditions).
     *
     * Only one callback can be active at the same time, so any
     * previously configured callback is replaced by the new one passed.
     *
     * \NotInMKRWAN
     */
    void setMaintainNeededCallback(std::function<void(void)> callback) { this->maintain_needed_callback = callback; }

    /// @}

    /**
     * Set the radio into continuous wave (CW) mode. In this mode radio outputs
     * a signal at the specified frequency and power for the specified duration.
     *
     * Used only for compliance testing and antenna testing.
     *
     * \param frequency Frequency in Hz.
     * \param powerdBm transmit power in dBm.
     * \param timeout Duration in seconds.
     * \returns true if CW mode was activated successfully.
     */

    bool continuousWave(uint32_t frequency, int8_t powerdBm, uint16_t timeout);

    /**
     * @name Dummy implementations
     *
     * These methods have only dummy implementations, because no
     * meaningful implementations exist and having a dummy
     * implementation is harmless (and also helps to make some examples
     * work without modification).
     *
     * @{
     */

    /**
     * Dummy for MKRWAN compatibility. On MKRWAN this returned the
     * module firmware version, but this does not apply here.
     * \DummyImplementation
     */
    String version() { return "N/A"; }

    /**
     * Dummy for MKRWAN compatibility. Exact purpose on MKRWAN is
     * unclear, see https://github.com/arduino-libraries/MKRWAN/issues/25
     * \DummyImplementation
     */
    [[gnu::deprecated("minPollInterval is a no-op on STM32LoRaWAN")]]
    void minPollInterval(unsigned long)
    { }
    /// @}

