stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.h
    /** @name Missing methods
     *
     * These methods are present in MKRWAN, but are not implemented in
     * this library (because they are specific to the module-based
     * serial approach used by MKRWAN, are for testing purposes only or
     * have better API not tied to the MKRWAN AT commands available.
     *
     * These methods *are* declared in this library, but marked so the
     * compiler can generate a friendly error message when they are
     * used.
     *
     * @{ */

    /** \NotImplemented{confirmed uplinked better handled through endPacket()} */
    [[gnu::error("Not implemented in STM32LoRaWAN: confirmed uplinked better handled through endPacket()")]]
    bool setCFM(bool cfm);

    /** \NotImplemented{confirmed uplinked better handled through endPacket()} */
    [[gnu::error("Not implemented in STM32LoRaWAN: confirmed uplinked better handled through endPacket()")]]
    int getCFM();

    /** \NotImplemented{confirmed uplinked better handled through endPacket()} */
    [[gnu::error("Not implemented in STM32LoRaWAN: confirmed uplinked better handled through endPacket()")]]
    int getCFS();

    /** \NotImplemented{no serial link to configure} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No serial to configure")]]
    bool begin(_lora_band band, uint32_t baud, uint16_t config = SERIAL_8N2);

    /** \NotImplemented{no serial link to configure} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No serial to configure")]]
    bool autoBaud(unsigned long timeout = 10000L);

    /** \NotImplemented{no serial link to configure} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No serial to configure")]]
    void setBaud(unsigned long baud);

    /** \NotImplemented{test method} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Test method")]]
    String getTConf();

    /** \NotImplemented{test method only} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Test method")]]
    String setTConf(String params);

    /** \NotImplemented{test method only} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Test method")]]
    bool enTtone();

    /** \NotImplemented{no remote module to restart} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No remote module to restart")]]
    bool restart();

    /** \NotImplemented{no remote module to poll} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No remote module to poll")]]
    void poll();

    /** \NotImplemented{no remote module to sleep} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No remote module to sleep")]]
    bool sleep(bool on = true);

    /** \NotImplemented{no remote module to reset} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No remote module to reset")]]
    bool factoryDefault();

    /** \NotImplemented{no protocol stream to configure} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No protocol stream to configure")]]
    bool format(bool hexMode);

    /** \NotImplemented{no protocol stream to configure} */
    [[gnu::error("Not implemented in STM32LoRaWAN: No protocol stream to configure")]]
    void dumb();

    /** \NotImplemented{seems to be an internal method in MKRWAN} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Internal method in MKRWAN")]]
    bool init();

    /** \NotImplemented{only class A supported} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Only class A supported")]]
    bool configureClass(_lora_class _class);

    /** \NotImplemented{Keys cannot be retrieved} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Keys cannot be retrieved")]]
    String getNwkSKey();

    /** \NotImplemented{Keys cannot be retrieved} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Keys cannot be retrieved")]]
    String getAppSKey();

    /** \NotImplemented{Keys cannot be retrieved} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Keys cannot be retrieved")]]
    String applicationKey();

    /** \NotImplemented{seems to be an internal method in MKRWAN (use enableChannel/disableChannel instead)} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Internal method in MKRWAN (use enableChannel/disableChannel instead)")]]
    bool sendMask(String newMask);

    /** \NotImplemented{seems to be an internal method in MKRWAN (use enableChannel/disableChannel instead)} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Internal method in MKRWAN (use enableChannel/disableChannel instead)")]]
    bool sendMask();

    /** \NotImplemented{seems to be an internal method in MKRWAN (use enableChannel/disableChannel instead)} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Internal method in MKRWAN (use enableChannel/disableChannel instead)")]]
    String getChannelMask();

    /** \NotImplemented{seems to be an internal method in MKRWAN (use enableChannel/disableChannel instead)} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Internal method in MKRWAN (use enableChannel/disableChannel instead)")]]
    int getChannelMaskSize(_lora_band band);

    /**
     * This could be supported, but needs careful consideration and
     * complete re-initialization.
     * \NotImplemented{Changing band after initialization not supported} */
    [[gnu::error("Not implemented in STM32LoRaWAN: Changing band after initialization not supported")]]
    bool configureBand(_lora_band band);
    /// @}

  protected:
    static void MacMcpsConfirm(McpsConfirm_t *McpsConfirm);
    static void MacMcpsIndication(McpsIndication_t *McpsIndication, LoRaMacRxStatus_t *RxStatus);
    static void MacMlmeConfirm(MlmeConfirm_t *MlmeConfirm);
    static void MacMlmeIndication(MlmeIndication_t *MlmeIndication, LoRaMacRxStatus_t *RxStatus);
    static void MacProcessNotify();

    static STM32LoRaWAN *instance;

    LoRaMacPrimitives_t LoRaMacPrimitives = {
      .MacMcpsConfirm = MacMcpsConfirm,
      .MacMcpsIndication = MacMcpsIndication,
      .MacMlmeConfirm = MacMlmeConfirm,
      .MacMlmeIndication = MacMlmeIndication,
    };

    LoRaMacCallback_t LoRaMacCallbacks = {
      .GetBatteryLevel = nullptr,
      .GetTemperatureLevel = nullptr,
      .GetUniqueId = nullptr, // Not needed, we just explicitly set the deveui in begin()
      .GetDevAddress = nullptr, // Not needed, user explicitly configures devaddr
      .NvmDataChange = nullptr,
      .MacProcessNotify = MacProcessNotify,
    };

    /** Generate the builtin DevEUI for this board */
    uint64_t builtinDevEUI();

    /**
     * Convert an enum value into string containing its name. The
     * string returned is a static constant, so no memory management
     * needed.
     */
    static const char *toString(LoRaMacStatus_t);
    /** \copydoc toString() */
    static const char *toString(LoRaMacEventInfoStatus_t);
    /** \copydoc toString() */
    static const char *toString(Mlme_t);
    /** \copydoc toString() */
    static const char *toString(Mcps_t);

    /** Convert a single hex char into its numerical value */
    static uint8_t parseHex(char c);
    /** Convert a hex string into a binary buffer */
    static bool parseHex(uint8_t *dest, const char *hex, size_t dest_len);
    /** Convert a nibble (0-15) to a hex char */
    static char toHex(uint8_t b);
    /** Convert a binary buffer to a hex string */
    static bool toHex(String *dest, const uint8_t *src, size_t src_len);

    /** Build a uint32_t from four bytes (big-endian, a is MSB) */
    static uint32_t makeUint32(uint8_t a, uint8_t b, uint8_t c, uint8_t d) { return (uint32_t)a << 24 | (uint32_t)b << 16 | (uint32_t)c << 8 | (uint32_t)d << 0; }

    /**
     * Helper that prints an error and then always returns false, to
     * allow for combining reporting and returning in a single line.
     */
    static bool failure(const char *fmt, ...)
    __attribute__((format(printf, 1, 2)));

    /** Empty the rx buffer */
    void clear_rx() { rx_ptr = rx_buf + sizeof(rx_buf); }

    /** Add data to the rx buffer */
    void add_rx(const uint8_t *buf, size_t len);

    /**
     * Datarate for joining and data transmission (until ADR changes it,
     * if enabled). This defaults to DR 4 since that is the
     * fastest/highest (least spectrum usage) DR that is supported by
     * all regions. If this DR has insufficient range, the join process
     * (and ADR) will fall back to lower datarates automatically.
     */
    uint8_t tx_dr = DR_4;

    /** Port for data transmissions. Default taken from MKRWAN_v2 / mkrwan1300-fw */
    uint8_t tx_port = 2;

    /** Port for most recently received packet */
    uint8_t rx_port = 0;

    bool nwk_key_set = false;

    // Buffer sizes match LORAMAC_PHY_MAXPAYLOAD (but that is not
    // public).
    uint8_t tx_buf[255];
    uint8_t *tx_ptr;
    uint8_t rx_buf[255];
    uint8_t *rx_ptr;

    bool last_tx_acked = false;
    uint32_t fcnt_up = 0;
    uint32_t fcnt_down = 0;

    std::function<void(void)> maintain_needed_callback;

    bool mac_process_pending = false;

    static constexpr uint32_t DEFAULT_JOIN_TIMEOUT = 60000;
};
// For MKRWAN compatibility
using LoRaModem = STM32LoRaWAN;
